CREATE TABLE IF NOT EXISTS books (
    id INT AUTO_INCREMENT PRIMARY KEY,
    title VARCHAR(255) NOT NULL,
    author VARCHAR(255) NOT NULL,
    publisher VARCHAR(255) NOT NULL,
    year INT NOT NULL
);

INSERT INTO books (title, author, publisher, year) VALUES 
('Кобзар', 'Тарас Шевченко', 'Веселка', 1840),
('Захар Беркут', 'Іван Франко', 'Основи', 1883),
('Тіні забутих предків', 'Михайло Коцюбинський', 'Літера', 1911),
('Лісова пісня', 'Леся Українка', 'Дніпро', 1911),
('Чорна рада', 'Пантелеймон Куліш', 'Веселка', 1857),
('Хіба ревуть воли, як ясла повні?', 'Панас Мирний', 'Ранок', 1880),
('Собор', 'Олесь Гончар', 'Український письменник', 1968),
('Солодка Даруся', 'Марія Матіос', 'А-БА-БА-ГА-ЛА-МА-ГА', 2004),
('Ворошиловград', 'Сергій Жадан', 'Фоліо', 2010),
('Місто', 'Валер\'ян Підмогильний', 'Книгоспілка', 1928);
